app/controllers/users_controller.rb

  def update
    if @user.update_attributes(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$icJGlT7kNtGaaNlE3.zFmecWlc5z6lLnSorEqAMk2q8n4DBKb5jUW', `avatar_file_name` = 'Tokyo-100-views（91〜95）.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 577248, `avatar_updated_at` = '2016-07-21 05:38:20', `updated_at` = '2016-07-21 05:38:20' WHERE `users`.`id` = 5

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1